<script setup lang="ts">
import Button from '~/components/form/Button.vue'

const activeType = ref(0)
const types = ref([
  {
    title: 'Интернет-магазин',
    description: 'Интернет-магазин — это цифровая торговая площадка, позволяющая пользователям просматривать, выбирать и приобретать товары или услуги через интернет. Современные онлайн-магазины обеспечивают удобную навигацию по каталогу, фильтры, поиск по параметрам, а также быстрый и безопасный процесс оформления заказа.'
  },
  {
    title: 'LSM',
    description: 'LSM (Log-Structured Merge-tree) — это структура данных, используемая для эффективного хранения и управления большими объёмами информации, особенно в системах, ориентированных на частую запись. Основной принцип LSM заключается в том, что данные сначала записываются в память, а затем периодически сливаются (merge) в более крупные, отсортированные файлы на диске.'
  },
  {
    title: 'CRM',
    description: 'CRM (Customer Relationship Management) — это система управления взаимоотношениями с клиентами, которая помогает компаниям организовать, автоматизировать и анализировать процессы продаж, маркетинга и клиентского сервиса. Благодаря CRM можно централизовать информацию о клиентах, отслеживать историю взаимодействий, управлять задачами и повышать уровень обслуживания.'
  },
  {
    title: 'Маркетплейсы',
    description: 'Маркетплейс — это онлайн-платформа, на которой различные продавцы могут размещать свои товары или услуги, а покупатели — выбирать, сравнивать и оформлять заказы в одном месте. В отличие от классического интернет-магазина, маркетплейс объединяет множество продавцов, предоставляя пользователям широкий выбор и удобство покупки.'
  },
  {
    title: 'SaaS-решения',
    description: 'SaaS (Software as a Service) — это модель предоставления программного обеспечения, при которой пользователи получают доступ к приложениям через интернет, а не устанавливают их на свои устройства. Вместо покупки и установки программ, пользователи платят за доступ к программным продуктам через подписку, и все обновления и техническая поддержка уже включены в стоимость.'
  },
  {
    title: 'Веб-сайт или сервис',
    description: 'Веб-сайт или сервис — это цифровая платформа, доступная через интернет, которая предоставляет пользователю определённые ресурсы, информацию или услуги. Веб-сайт может быть как простой информационной страницей, так и сложным сервисом с множеством функциональных возможностей, таких как онлайн-магазины, социальные сети, блоги, форумы и многое другое.'
  },
])

const onClickType = (index: number) => {
  activeType.value = index
}
</script>

<template>
  <section id="dev-types" class="dev-types">
    <h2>Что мы разрабатываем</h2>
    <div class="dev-types__wrapper">
      <div>
        <div class="dev-types__list">
          <button
              v-for="(type, index) in types"
              :class="{'--active': activeType === index}"
              @click="onClickType(index)"
          >{{ type.title }}</button>
        </div>
        <Button class="dev-types__lead --desktop" icon="chat">Обсудить детали</Button>
      </div>
      <div class="dev-types__detail --desktop">
        <div>{{ types[activeType].title }}</div>
        <div>{{ types[activeType].description }}</div>
      </div>
      <div class="dev-types__detail --mobile">
        <div>{{ types[activeType].title }}</div>
        <div>{{ types[activeType].description }}</div>
        <div />
      </div>
      <Button class="dev-types__lead --mobile" icon="chat">Обсудить детали</Button>
    </div>
  </section>
</template>