<script setup lang="ts">
const reviews = ref([
  {
    title: 'Егор Шугаев, ex-Дизайн-директор в Газпром нефть',
    description: 'Я, как человек с художественным образованием, вижу большие проблемы с композицией и цветоведением. К сожалению, стало проще научить UX, чем UI, так как экспертизы в UX стало больше. Если бы можно было нанять дизайнера с хорошей головой в UX в штат, потом отдать на платный курс для апгрейда UI-скилла.'
  },
  {
    title: 'Егор Шугаев, ex-Дизайн-директор в Газпром нефть',
    description: 'Я, как человек с художественным образованием, вижу большие проблемы с композицией и цветоведением. К сожалению, стало проще научить UX, чем UI, так как экспертизы в UX стало больше. Если бы можно было нанять дизайнера с хорошей головой в UX в штат, потом отдать на платный курс для апгрейда UI-скилла.'
  },
  {
    title: 'Егор Шугаев, ex-Дизайн-директор в Газпром нефть',
    description: 'Я, как человек с художественным образованием, вижу большие проблемы с композицией и цветоведением. К сожалению, стало проще научить UX, чем UI, так как экспертизы в UX стало больше. Если бы можно было нанять дизайнера с хорошей головой в UX в штат, потом отдать на платный курс для апгрейда UI-скилла.'
  },
])
</script>

<template>
  <section id="reviews" class="reviews">
    <h2>Отзывы</h2>
    <div class="reviews__reviews">
      <div class="reviews__review-wrapper" v-for="review in reviews">
        <div class="reviews__review">
          <div class="reviews__review-head">
            <img src="/images/reviews/1.png" alt="review-1">
            <div>{{ review.title }}</div>
          </div>
          <p>{{ review.description }}</p>
        </div>
      </div>
    </div>
  </section>
</template>